# Импорт библиотеки
import sqlite3

# Подключение к БД
con = sqlite3.connect("films_db.sqlite")

# Создание курсора
cur = con.cursor()
list_of_lists = ([], [], [], [], [], [])
schedule = [
    ['История', 'Право', 'Информатика', 'Химия', 'География', 'Лит-ра',
     'Алгебра'],
    ['ОБЖ', 'Алгебра', 'Физ-ра', 'Русский', 'Английский', 'Биология'],
    ['Физика', 'Экономика', 'Геометрия', 'Общество', 'Геометрия', 'Английский',
     'Физ-ра'],
    ['Алгебра', 'Физика', 'Астрономия', 'История', 'Информатика', 'Общество',
     'Английский'],
    ['Алгебра', 'Русский', 'Лит-ра', 'с/к хим. био.', 'Родной язык',
     'Инд.проект'],
    ['Русский', 'Физ-ра', 'Лит-ра', 'Род. лит-ра']
]
for i in schedule:
    for j in i:
        list_of_lists.append()

# Выполнение запроса и получение всех результатов
result = cur.execute("""SELECT * FROM films
            WHERE year = 2010""").fetchall()
cur.execute('''UPDATE lessons(Tuesday) VALUES ?''', )
